fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПосчитатьДни();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПосчитатьДни();

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ПосчитатьДни();

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьДиаграммуГанта(Команда)
	
	АдресВХранилище = ДиаграммаГантаЗаполнитьНаСервере();
	ПарамФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПарамФормы);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере		
Функция ДиаграммаГантаЗаполнитьНаСервере()
	
	ВыгружаемаяТЧ = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания");
	Адрес = ПоместитьВоВременноеХранилище(ВыгружаемаяТЧ);
	Возврат Адрес;
	
КонецФункции		

&НаСервере
Процедура ПосчитатьДни()
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Не ЗначениеЗаполнено(Строка.ДатаНачала) Или Не ЗначениеЗаполнено(Строка.ДатаОкончания)
			Тогда Строка.КоличествоДней = 0;
		Иначе
		Строка.КоличествоДней = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
		КонецЕсли;
		
	КонецЦикла;	
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	ТаблицаОтпусков.Свернуть("Сотрудник", "КоличествоДней");
	
	СоответствиеДнейПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаОтпусков Цикл
    	Сотрудник = СтрокаТаблицы.Сотрудник;
   		СуммарныеДни = СтрокаТаблицы.КоличествоДней;
    СоответствиеДнейПоСотрудникам[Сотрудник] = СуммарныеДни;
	КонецЦикла;

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
    	СотрудникТекущейСтроки = Строка.Сотрудник;
    Если СоответствиеДнейПоСотрудникам.Получить(СотрудникТекущейСтроки) Тогда
        Строка.КоличествоДней = СоответствиеДнейПоСотрудникам[СотрудникТекущейСтроки];
    Иначе
        Строка.КоличествоДней = 0; 
    КонецЕсли;
КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
